Python
    variables - storing data
    data types - int float string list dictionary sets range
    functions - create reusable codes
    classes - help us containerise codes, box things up

libraries
    numpy - **arrays** foundations of numpy, create matrices, numerical calculation
    pandas - **DataFrames** store data like spreadsheet, excel sheets, can manipulate tables


Machine learning
    data - clean data
    feed to the machine
    show machine what is right what is wrong (learns, create its own patterns)
    then ask questions, and get answers

dictionaries
    we will try to create a dictionary
    data types with keys and values

In [2]:
#create a small dictionary
#names of 4 students, and their marks

students = {'name': 'Syazwan','Marks': 90}

In [3]:
print(students)

{'name': 'Syazwan', 'Marks': 90}

In [15]:
#create a small dictionary
#names of 4 students, and their marks

students = {'name': ['Syazwan','Azim','Aqil','Azam']},{'Marks': [90,85,88,92]}

print(students)

({'name': ['Syazwan', 'Azim', 'Aqil', 'Azam']}, {'Marks': [90, 85, 88, 92]})

In [10]:
students = {'name':'Syazwan',
            'name': 'Azim',
            'name': 'Aqil',
            'name':'Azam', 
            'Marks': 90,
            'Marks': 85,
            'Marks': 88,
            'Marks': 92}

print(students)

{'name': 'Azam', 'Marks': 92}

In [11]:
students = {'Syazwan':90,
            'Azim':85,
            'Aqil':88,
            'Azam':92}

print(students)

{'Syazwan': 90, 'Azim': 85, 'Aqil': 88, 'Azam': 92}

In [84]:
students = {'name': ['Syazwan', 'Azim', 'Aqil', 'Azam','Afiq','Wan'], 
            'BM': [90, 85, 88, 91,76,56],
            'Math': [90, 85, 88, 92,87,77],
            'Sci': [90, 85, 88, 93,75,89]}

In [33]:
students["name"]
students["BM"]

[90, 85, 88, 92]

In [35]:
pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp314-cp314-macosx_11_0_arm64.whl.metadata (91 kB)
Requirement already satisfied: numpy>=1.26.0 in /Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/syazwan/Library/Python/3.14/lib/python/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /Users/syazwan/Library/Python/3.14/lib/python/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp314-cp314-macosx_11_0_arm64.whl (10.8 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 10.8/10.8 MB 1.5 MB/s  0:00:06 eta 0:00:01
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3/3 [pandas]2m2/3 [pandas]
Successfully installed pandas-2.3.3 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

In [36]:
import pandas as pd

In [87]:
df = pd.DataFrame(students)

df
print(df,'\n' 'first table' '\n')
print(df, '\n')
print(df)

      name  BM  Math  Sci
0  Syazwan  90    90   90
1     Azim  85    85   85
2     Aqil  88    88   88
3     Azam  91    92   93
4     Afiq  76    87   75
5      Wan  56    77   89
first table

      name  BM  Math  Sci
0  Syazwan  90    90   90
1     Azim  85    85   85
2     Aqil  88    88   88
3     Azam  91    92   93
4     Afiq  76    87   75
5      Wan  56    77   89

      name  BM  Math  Sci
0  Syazwan  90    90   90
1     Azim  85    85   85
2     Aqil  88    88   88
3     Azam  91    92   93
4     Afiq  76    87   75
5      Wan  56    77   89

In [52]:
type(df)

pandas.core.frame.DataFrame

In [61]:
df.head() # top 5 rows is the default argument

      name  BM  Math  Sci
0  Syazwan  90    90   90
1     Azim  85    85   85
2     Aqil  88    88   88
3     Azam  91    92   93
4     Afiq  76    87   75

In [62]:
df.tail() # bottom 5 rows is the default argument

      name  BM  Math  Sci
0  Syazwan  90    90   90
1     Azim  85    85   85
2     Aqil  88    88   88
3     Azam  91    92   93
4     Afiq  76    87   75

In [65]:
df.Math

0    90
1    85
2    88
3    92
4    87
Name: Math, dtype: int64

In [80]:
print('\n Names column ---------\n',df['name'])
print('\n BM column ---------\n',df['BM'])
print('\n Math column ---------\n',df['Math'])
print('\n Sci column ---------\n',df['Sci'])

 Names column ---------
 0    Syazwan
1       Azim
2       Aqil
3       Azam
4       Afiq
Name: name, dtype: object

 BM column ---------
 0    90
1    85
2    88
3    91
4    76
Name: BM, dtype: int64

 Math column ---------
 0    90
1    85
2    88
3    92
4    87
Name: Math, dtype: int64

 Sci column ---------
 0    90
1    85
2    88
3    93
4    75
Name: Sci, dtype: int64

In [79]:
# series

marks_series = pd.Series([1,2,3,4,5,6], name = 'Maths')
#type(marks_series)
print(marks_series)

0    1
1    2
2    3
3    4
4    5
5    6
Name: Maths, dtype: int64

In [88]:
df

      name  BM  Math  Sci
0  Syazwan  90    90   90
1     Azim  85    85   85
2     Aqil  88    88   88
3     Azam  91    92   93
4     Afiq  76    87   75
5      Wan  56    77   89

In [101]:
#how many marks afiq have in math?

print('Afiq Math Mark:',df['Math'][4])

math_afiq = df['Math'][4]
math_afiq

Afiq Math Mark: 87

np.int64(87)

In [105]:
print(f' In Math, {df.name[4]} had {df.Math[4]} marks.')

print(f' In Math, {df['name'][4]} had {df['Math'][4]} marks.')

af = df['name'][4]
af_math = df['Math'][4]

print(f' In Math, {af} had {af_math} marks.')

 In Math, Afiq had 87 marks.
 In Math, Afiq had 87 marks.
 In Math, Afiq had 87 marks.

In [ ]:
# create a series of data pd.series 5 values of temperature

temp_series = pd.Series([19,27,16,31,21],name = 'temperature')
type(temp_series)

print(temp_series)

0    19
1    27
2    16
3    31
4    21
Name: temperature, dtype: int64

In [168]:
# create dataframe city and temperature - 5 cities

#create a dictionary
temp_city = {'City':['KL','Seremban','Seri Kembangan','Shah Alam','Petaling Jaya'],
                       'Temp':[-1,23,-16,33,25]}

#convert to dataframe
temp_df = pd.DataFrame(temp_city)
type(temp_df)

print(temp_df)

             City  Temp
0              KL    -1
1        Seremban    23
2  Seri Kembangan   -16
3       Shah Alam    33
4   Petaling Jaya    25

In [169]:
# clone the dataframe
df2 = temp_df

# add the series to new dataframe
df2['temp_series'] = temp_series

df2

             City  Temp  temp_series
0              KL    -1           19
1        Seremban    23           27
2  Seri Kembangan   -16           16
3       Shah Alam    33           31
4   Petaling Jaya    25           21

In [184]:
# pandas dataframe will create new column/keys that dont exist
df3 = df2

df3['empty_temp'] = {}

df3['new_temp1'] = pd.Series([1,2,3])

df3['new_temp2'] = pd.Series([4,5,6])

df3

             City  Temp  temp_series new_temp  new_temp1  new_temp2 empty_temp
0              KL    -1           19      NaN        1.0        4.0        NaN
1        Seremban    23           27      NaN        2.0        5.0        NaN
2  Seri Kembangan   -16           16      NaN        3.0        6.0        NaN
3       Shah Alam    33           31      NaN        NaN        NaN        NaN
4   Petaling Jaya    25           21      NaN        NaN        NaN        NaN

In [193]:
# create csv from the dataframe
df3.to_csv('df3.csv')
temp_df.to_csv('temp_df1.csv',index = False)